taskt/Core/Automation/Commands/DateTimeGroup/IDateTimeResultProperties.puml
@startuml
left to right direction
package "taskt.Core.Automation.Commands"{
Interface "IDateTimeResultProperties" {
+{abstract} v_Result : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
Interface "ICanHandleDateTime" {
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExpandableProperties" {
}
}

taskt.Core.Automation.Commands.IDateTimeResultProperties --|> taskt.Core.Automation.Commands.ICanHandleDateTime
taskt.Core.Automation.Commands.ICanHandleDateTime --|> taskt.Core.Automation.Commands.IExpandableProperties
@enduml
